Revit 2027 API
AnalysisDisplayColorEntry(Color, Double) Constructor
 Constructs a color entry with a specific value assigned.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColorEntry(
	Color color,
	double value
)
Public Sub New (
	color As Color,
	value As Double
)
public:
AnalysisDisplayColorEntry(
	Color^ color,
	double value
)
new :
        color : Color *
        value : float -> AnalysisDisplayColorEntry
Parameters
color Color
 Color assigned to the entry.
value Double
 Value assigned to the entry.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Overload
Autodesk.Revit.DB.Analysis Namespace